package ua.lviv.lgs.sentence;

import java.util.Arrays;

public class Main {

	public static void main(String[] args) {

		// 1. Task1. Рахуємо слова в реченні

		String qtyWord = new String("Жанр раку літерального, який в українській "
				+ "літературі започаткував Іван Величковський, 1977 року в дитячій збірці "
				+ "«Чарівний глобус» відродив Володимир Лучук (батько Івана Лучука). "
				+ "Нині в Україні понад 20 поетів мають у доробку раки літеральні. "
				+ "Існує навіть «Об'єднання голінних ентузіастів рака літерального (ГЕРАКЛІТ)», "
				+ "що й свідчить про те, що із банальної спокуси здивувати загал і колег, "
				+ "рак літеральний доріс до серйозного явища сучасної поезії поезії поезії поезії.");

		// Забираємо можливі пробіли перед і після тексту
		qtyWord = qtyWord.trim();

		// Забираємо можливі зайві пробіли всередині тексту
		qtyWord = qtyWord.replaceAll("  ", " ");

		// Рахуємо к-ть пробілів всередині, кількість слів - на одне більше, ніж
		// всередині.
		System.out.println(qtyWord.length() - qtyWord.replaceAll(" ", "").length() + 1);

		// 2. Task2. Рахуємо слова в Тексті

		String gtySentenсes = new String("Жанр раку літерального, який в українській "
				+ "літературі започаткував Іван Величковський, 1977 року в дитячій збірці "
				+ "«Чарівний глобус» відродив Володимир Лучук (батько Івана Лучука). "
				+ "Нині в Україні понад 20 поетів мають у доробку раки літеральні. "
				+ "Існує навіть «Об'єднання голінних ентузіастів рака літерального (ГЕРАКЛІТ)», "
				+ "що й свідчить про те, що із банальної спокуси здивувати загал і колег, "
				+ "рак літеральний доріс до серйозного явища сучасної поезії.");

		// Кількість речень дорівнюють кількості розділювачів речення
		System.out.println(gtySentenсes.length()
				- gtySentenсes.replaceAll("\\Q.\\E", "").replaceAll("\\Q;\\E", "").replaceAll("\\Q:\\E", "").length());

		// 3. Task 3-4.Найбільш повторюване слово в реченні і в тексті - алгоритм
		// аналогічний, розділювачі виключені всі

		qtyWord = qtyWord.replaceAll("\\Q.\\E", "").replaceAll("\\Q,\\E", "");

		String[] array = qtyWord.split(" ");

		int count = 0;

		// Сховище для позиції слова,що найбільше зустрічається
		int buferForOW[] = { 0, -1 };

		for (int i = 0; i < array.length; i++) {
			
			//Перше слово - завжди 1
			if (buferForOW[1] < 0) {
				count = 1;
				
				//якщо слово не перше, то порівнюємо з тим, яке на даний момент найбільше зустрічалось
				//присвоюємо одиницю йому
			} else if (array[buferForOW[0]].compareTo(array[i]) != 0) {
				count = 1;
				
				//Виходимо з циклу при повторі опрацювання слів
			} else {
				continue;
			}
			
			
             //порівнюємо елементи слів Стрінга
			for (int j = i + 1; j < array.length; j++) {

				//при співпадінні слів додаємо йому в лічильник +1
				if (array[i].compareTo(array[j]) == 0) {
					count++;
				}
			}
			
			
			if (buferForOW[1] <= count) {
				buferForOW[0] = i;
				buferForOW[1] = count;
			}

		}

		System.out.println("often word is " + array[buferForOW[0]] + " (зустрічається " + buferForOW[1] + " рази)");

	}

}
